#include "StdAfx.h"
////////////////////////机械兵

//极光护盾
int E_Shield_BlockRate[10] = { 4,5,6,7,8,9,10,11,13,15 };
int E_Shield_UseTime[10] = { 300,300,300,300,300,300,300,300,300,300 };
int E_Shield_UseMana[10] = { 12,14,17,20,23,26,30,34,39,44 };

//机械榴弹
int Mechanic_Bomb_Damage[10][2] = { {5,10},{10,20},{15,30},{20,40},{25,50},{30,60},{35,70},{40,80},{45,90},{50,100} };
int Mechanic_Bomb_Attack_Range[10] = { 64,68,72,76,80,84,88,92,96,100 };
int Mechanic_Bomb_UseMana[10] = { 8,10,12,14,17,20,23,26,29,33 };

//毒之防御 
int PlusPoison[10] = { 5,10,15,20,25,30,35,40,45,50 };

//灵光护体
int P_Absorb[10] = { 4,6,12,14,20,22,28,30,36,38 };
int P_Absorb_UseTime[10] = { 300,300,300,300,300,300,300,300,300,300 };
int P_Absor_bUseMana[10] = { 20,24,28,32,36,40,44,48,52,56 };

//破碎巨击
int G_Smash_Attack_Rate[10] = { 60,70,80,90,100,120,140,160,180,200 };
int G_Smash_Attack_Rage[10] = { 8,16,24,32,40,48,56,64,72,80 };
int G_Smash_UseMana[10] = { 22,25,28,31,34,38,42,46,50,54 };

//改良专家
int Maximize_Damage[10] = { 7,14,21,28,35,42,49,56,63,70 };
int Maximize_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Maximize_UseMana[10] = { 26,28,30,33,36,39,43,47,51,56 };

//灵光飞扬
int Automation_Damage[10] = { 20,40,60,80,100,120,140,160,180,200 };
int Automation_Speed[10] = { 3,3,3,4,4,4,5,5,5,6 };
int Automation_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Automation_UseMana[10] = { 24,27,30,33,36,39,42,45,48,51 };

//火花电场
int Spark_Damage[10][2] = { {30,40},{60,80},{90,120},{120,160},{150,200},{180,240},{210,280},{240,320},{270,360},{300,400} };
int Spark_Area[10] = { 30,40,50,60,70,80,90,100,110,120 };
int Spark_UseMana[10] = { 26,28,31,34,37,40,44,46,50,55 };

//金属重甲
int Metal_Armor_Defense[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Metal_Armor_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Metal_Armor_UseMana[10] = { 32,35,38,41,44,48,52,56,60,64 };

//星光灭绝
int Grand_Smash_AttackRate[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Grand_Smash_Damage[10] = { 25,31,37,43,49,55,61,67,73,79 };
int Grand_Smash_UseMana[10] = { 26,29,32,35,38,41,44,47,50,53 };

//优化专家
int M_Weapon_Mastey[10] = { 4,8,12,16,20,24,28,32,36,40 };

//防御电波
int Spark_Shield_Damage[10] = { 30,42,54,66,78,90,102,114,126,138 };
int Spark_Shield_Defense[10] = { 24,48,72,96,120,144,168,192,216,240 };
int Spark_Shield_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Spark_Shield_UseMana[10] = { 34,36,38,41,44,47,51,55,59,64 };

//雷霆冲击
int Impulsion_LightingDamage[10] = { 20,25,30,35,40,45,50,55,60,65 };
int Impulsion_Range[10] = { 130,135,140,145,150,155,160,165,170,175 };
int Impulsion_LightingNum[10] = { 6,7,8,9,10,11,12,13,14,15 };
int Impulsion_UseMana[10] = { 35,38,40,43,46,49,53,57,61,65 };

//威慑怒吼
int Compulsion_AddAbsorb[10] = { 3,6,9,13,17,21,26,31,36,42 };
int Compulsion_Area[10] = { 150,160,170,180,190,200,210,220,230,240 };
int Compulsion_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Compulsion_UseMana[10] = { 50,54,58,62,66,70,74,78,82,86 };

//磁性球体
int Magnetic_Sphere_AddDamage[10][2] = { {20,40},{40,80},{60,120},{80,160},{100,200},{120,240},{140,280},{160,320},{180,360},{200,400} };
int Magnetic_Sphere_Area[10] = { 60,70,80,90,100,110,120,130,140,150 };
int Magnetic_Sphere_AttackDelay[10] = { 4,4,4,3,3,3,2,2,2,1 };
int Magnetic_Sphere_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Magnetic_Sphere_UseMana[10] = { 60,65,70,75,80,85,90,95,100,105 };

//终极机械
int Metal_Golem_Damage[10][2] = { {155,180},{165,190},{175,200},{185,210},{195,220},{205,230},{215,240},{225,250},{235,260},{245,270} };
int Metal_Golem_Hit[10] = { 200,400,600,800,1000,1200,1400,1600,1800,2000 };
int Metal_Golem_Defense[10] = { 1000,2000,3000,4000,5000,6000,7000,8000,9000,10000 };
int Metal_Golem_Life[10] = { 3000,6000,9000,12000,15000,18000,21000,24000,27000,30000 };
int Metal_Golem_UseMana[10] = { 60,64,68,72,76,80,84,88,92,96 };

//霹雳旋风
int Landminning_AddDamage[10] = { 30,40,50,60,70,80,90,100,110,120 };
int Landminning_Area[10] = { 80,90,100,110,120,130,140,150,160,170 };
int Landminning_Num[10] = { 6,7,8,9,10,11,12,13,14,15 };
int Landminning_UseMana[10] = { 55,58,61,64,67,70,73,76,79,82 };

//快速打击
int H_Sonic_Speed[10] = { 3,6,9,11,13,15,16,17,18,19 };
int H_Sonic_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int H_Sonic_UseMana[10] = { 80,85,90,95,100,105,110,115,120,125 };

//究极之刃
int R_Smash_AddDamage[10] = { 15,30,45,60,75,90,105,120,135,150 };
int R_Smash_UseMana[10] = { 60,63,66,69,72,75,78,81,84,87 };

//战神祝福
int P_Enhence_AddDamage[10][2] = { {4,4},{8,8},{12,12},{16,16},{20,20},{24,24},{28,28},{32,32},{36,36},{40,40} };
int P_Enhence_Defanse[10] = { 220,240,260,280,300,320,340,360,380,400 };
int P_Enhence_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int P_Enhence_UseMana[10] = { 85,90,95,100,105,110,115,120,125,130 };


////////////////////////////武士
//格斗之术
int Melee_Mastery_DamagePercent[10] = { 6,10,14,18,21,24,26,28,30,32 };

//火之防御
int PlusFire[10] = { 9,17,24,30,35,39,42,44,45,46 };

//绝地暴走
int Raving_Damage[10] = { 13,16,19,22,25,28,31,34,37,40 };
int Ravind_Speed[10] = { 2,2,2,3,3,3,4,4,4,4 };
float Raving_UseLife[10] = { 1.f,1.3f,1.6f,1.9f,2.2f,2.5f,2.8f,3.1f,3.4f,3.7f };
int Raving_UseMana[10] = { 14,16,18,20,22,24,26,29,32,35 };

//精准之击
int Impact_Attack_Rating[10] = { 20,40,60,80,100,120,140,160,180,200 };
int Impact_Damage[10] = { 20,25,29,33,37,41,45,49,52,55 };
int Impact_UseMana[10] = { 18,20,22,24,26,29,33,37,41,45 };

//威力冲击
int T_Impact_Damage[10] = { 10,15,20,25,30,35,40,45,50,55 };
int T_Impact_Hit[10] = { 1,1,2,2,2,3,3,3,3,3 };
int T_Impact_UseMana[10] = { 22,24,26,29,32,35,38,41,44,47 };

//致命回旋
int B_Swing_Damage[10] = { 10,16,22,28,34,40,45,50,55,60 };
int B_Swing_Critical[10] = { 3,7,10,13,16,19,21,24,27,30 };
int B_Swing_UseMana[10] = { 24,26,28,31,34,38,42,47,52,58 };

//极地怒吼
int Roar_Range[10] = { 50,60,70,80,90,100,108,116,124,130 };
int Roar_Time[10] = { 4,6,8,10,12,14,16,18,20,22 };
int Roar_UseMana[10] = { 26,28,30,33,36,39,42,45,49,53 };

//战神之怒
int R_Zecram_Damage[10] = { 14,28,42,56,70,84,98,112,126,140 };
int R_Zecram_Area[10] = { 100,100,100,100,100,100,100,100,100,100 };
int R_Zecram_UseMana[10] = { 29,31,33,36,39,42,45,49,53,58 };

//会心一击
int Concentration_AttackRate[10] = { 16,32,48,64,80,96,112,128,144,160 };
int Concentration_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Concentration_UseMana[10] = { 35,38,41,44,47,50,53,56,59,62 };

//复仇连击
int A_Crash_Damage[10] = { 50,55,60,65,70,75,80,85,90,95 };
int A_Crash_AttackRate[10] = { 5,10,15,20,25,30,35,40,45,50 };
int A_Crash_UseMana[10] = { 32,34,36,38,41,44,47,50,53,56 };

//刺杀之斧
int Swift_Axe_Speed[10] = { 1,2,3,4,5,7,9,10,12,14 };
int Swift_Axe_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Swift_Axe_UseMana[10] = { 40,44,48,52,56,60,64,68,72,76 };

//挫骨扬灰
int B_Crash_Damage[10] = { 50,55,60,65,70,75,80,85,90,95 };
int B_Crash_DemonDamage[10] = { 50,55,60,65,70,75,80,85,90,95 };
int B_Crash_UseMana[10] = { 34,36,38,41,44,47,50,53,56,59 };

//破坏之击
int Destoryer_DamagePercent[10] = { 15,30,45,60,75,90,105,120,135,150 };
int Destoryer_AddCritical[10] = { 10,12,14,16,18,20,22,24,26,28 };
int Destoryer_UseMana[10] = { 46,48,50,52,54,56,58,60,62,64 };

//疯狂怒吼
int Berserker_AddAttack[10] = { 60,60,90,90,120,120,150,150,180,180 };
int Berserker_SubAbsorb[10] = { -5,-5,-5,-5,-10,-10,-10,-10,-15,-15 };
int Berserker_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Berserker_UseMana[10] = { 52,55,58,61,64,67,70,73,76,79 };

//飓风袭击
int Cyclone_Strike_DamagePercent[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Cyclone_Strike_AttackNum[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Cyclone_Strike_Area[10] = { 100,105,110,115,120,125,130,135,140,145 };
int Cyclone_Strike_UseMana[10] = { 50,53,56,59,62,65,68,71,74,77 };

//健康专家
int Boost_Health_Life[10] = { 25,50,75,100,125,150,175,200,225,250 };

//狂暴怒斩
int D_Hit_AddDamage[10] = { 15,30,45,60,75,90,105,120,135,150 };
int D_Hit_UseMana[10] = { 58,61,64,67,70,73,76,79,82,85 };

//狂野冲击
int P_Dash_AddDamage[10] = { 15,30,45,60,75,90,105,120,135,150 };
int P_Dash_Area[10] = { 50,60,70,80,90,100,110,120,130,140 };
int P_Dash_Time[10] = { 10,13,16,19,22,25,28,31,34,37 };
int P_Dash_UseMana[10] = { 70,75,80,85,90,95,100,105,110,115 };

//回旋斩击
int M_Blow_AddDamage[10] = { 15,25,35,45,55,65,75,85,95,105 };
int M_Blow_AttackNum[10] = { 6,7,8,9,10,11,12,13,14,15 };
int M_Blow_Area[10] = { 120,130,140,150,160,170,180,190,200,210 };
int M_Blow_UseMana[10] = { 63,66,69,72,75,78,81,84,87,90 };

//众神之怒
int B_Berserker_AddDamage[10] = { 10,11,12,13,14,15,16,17,18,19 };
int B_Berserker_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int B_Berserker_UseMana[10] = { 86,90,94,98,102,106,110,114,118,122 };

///////////////////////////枪兵
//龙卷枪风
int Pike_Wind_Throw_Height[10] = { 10,10,10,10,10,10,10,10,10,10 };
int Pike_Wind_Damage[10][2] = { {3,20},{5,27},{7,34},{9,41},{11,48},{13,52},{15,59},{17,66},{19,73},{21,80} };
int Pike_Wind_Push_Lenght[10] = { 70,75,80,85,90,95,100,105,110,120 };
int Pike_Wind_UseMana[10] = { 14,16,18,20,23,26,29,32,35,39 };

//冰之防御
int PlusIce[10] = { 8,15,21,26,30,33,36,39,42,45 };

//致命打击
int Critical_Hit_Critical[10] = { 15,19,23,26,29,32,34,36,38,40 };
int Critical_Hit_UseMana[10] = { 14,16,18,20,23,26,29,33,37,41 };

//霹雳一击
int Jumping_Crash_UseMana[10] = { 16,18,20,23,26,29,32,35,39,43 };
int Jumping_Crash_Attack_Rating[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Jumping_Crash_Damage[10] = { 6,12,18,24,30,36,42,48,54,60 };

//大地之枪
int G_Pike_Damage[10][2] = { {10,40},{13,45},{16,50},{19,55},{22,60},{25,65},{28,70},{31,75},{34,80},{37,85} };
int G_Pike_Range[10] = { 80,82,84,86,88,90,92,94,96,98 };
int G_Pike_UseMana[10] = { 19,21,23,25,28,31,34,38,42,46 };
int G_Pike_Time[10] = { 3,4,5,6,7,8,9,10,11,12 };

//枪之飓风
int Tornado_Damage[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Tornado_Stun[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Tornado_Range[10] = { 44,48,52,56,60,64,68,72,76,80 };
int Tornado_UseMana[10] = { 23,25,27,29,32,35,38,42,46,51 };

//躲避专家
int W_D_Mastery_Block[10] = { 2,3,4,5,6,8,10,12,14,16 };

//无限力枪
int Expansion_Size[10] = { 16,32,48,64,80,96,112,128,144,160 };
int Expansion_Damage[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Expansion_UseMana[10] = { 26,28,30,33,36,39,43,47,51,55 };

//灵蛇标枪
int VenomSpear_Damage[10] = { 25,50,75,100,125,150,175,200,225,250 };
int VenomSpear_Num[10] = { 5,5,5,5,6,6,6,6,7,8 };
int VenomSpear_Time[10] = { 5,5,5,5,6,6,6,6,7,8 };
int VenomSpear_Range[10] = { 90,94,98,102,106,110,114,118,122,126 };
int VenomSpear_UseMana[10] = { 30,33,36,39,42,45,48,51,54,57 };

//隐暗之术
float Vanish_Speed[10] = { 0.2f,0.4f,0.6f,0.8f,1.0f,1.2f,1.4f,1.6f,1.8f,2.0f };
int Vanish_Damage[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Vanish_Range[10] = { -40,-46,-52,-58,-64,-70,-75,-80,-85,-90 };
int Vanish_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Vanish_UseMana[10] = { 40,43,46,49,52,55,58,62,66,71 };

//会心之枪
int Critical_Mastery_Critical[10] = { 1,2,4,6,8,10,12,14,16,18 };

//链骑之枪
int Chain_Lance_Damage[10] = { 12,18,24,30,36,42,48,54,62,70 };
int Chain_Lance_UseMana[10] = { 32,35,38,41,44,47,50,53,56,59 };

//暗杀之眼
int Assassin_Eye_AddCritical[10] = { 10,14,18,22,26,30,34,38,42,46 };
int Assassin_Eye_M_SubCritical[10] = { -4,-5,-6,-7,-8,-9,-10,-11,-12,-13 };
int Assassin_Eye_Time[10] = { 12,13,14,15,16,17,18,19,20,21 };
int Assassin_Eye_UseMana[10] = { 47,49,51,53,55,57,59,61,63,65 };

//转换
int Charging_Strike_DamagePercent[10] = { 6,12,18,24,30,36,42,48,54,60 };
int Charging_Strike_CharingDamagePercent[10] = { 13,26,39,52,65,78,91,104,117,135 };
int Charging_Strike_Time[10] = { 0,8,12,16,20,24,28,32,36,40 };
int Charging_Strike_UseMana[10] = { 48,51,54,57,60,63,66,69,72,75 };

//影盾
int Vague_EvasionPercent[10] = { 7,9,11,13,15,17,19,21,23,25 };
int Vague_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Vague_UseMana[10] = { 55,58,61,64,67,70,73,76,79,82 };

//宇宙幻影
int Shadow_Master_DamagePercent[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Shadow_Master_AddHit[10] = { 110,120,130,140,150,160,170,180,190,200 };
int Shadow_Master_ShadowNum[10] = { 3,3,4,4,5,5,6,6,7,7 };
int Shadow_Master_UseMana[10] = { 52,55,58,61,64,67,70,73,76,79 };

//回旋打击
int D_Reaper_AddDamage[10] = { 20,40,60,80,100,120,140,160,180,200 };
int D_Reaper_UseMana[10] = { 58,61,64,67,70,73,76,79,82,85 };

//地枪奇袭
int F_Spear_AddDamage[10] = { 15,20,25,30,35,40,45,50,55,60 };
int F_Spear_Area[10] = { 120,130,140,150,160,170,180,190,200,210 };
int F_Spear_Num[10] = { 5,5,5,5,6,6,6,6,7,8 };
int F_Spear_UseMana[10] = { 63,66,69,72,75,78,81,84,87,90 };

//潜能激发
int Amplified_SubAbs[10] = { -5,-7,-9,-11,-13,-15,-17,-19,-21,-23 };
int Amplified_AddHit[10] = { 30,35,40,45,50,55,60,65,70,75 };
int Amplified_MinAddDamage[10] = { 5,10,15,20,25,30,35,40,45,50 };
int Amplified_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Amplified_UseMana[10] = { 86,90,94,98,102,106,110,114,118,112 };

//旋风之枪
int SS_Attack_AddDamage[10] = { 10,30,50,70,90,110,130,150,170,190 };
int SS_Attack_UseMana[10] = { 70,75,80,85,90,95,100,105,110,115 };


///////////////////////////弓手
//侦查之鹰
int Scout_Hawk_Attack_Rate[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Scout_Hawk_UseTime[10] = { 5,6,7,8,9,10,11,12,13,14 };
int Scout_Hawk_UseMana[10] = { 14,16,18,20,23,26,30,34,39,44 };

//强力之箭
int S_Mastery_DamagePercent[10] = { 6,12,14,24,30,36,42,48,54,60 };

//疾风之箭
int Wind_Arrow_Speed[10] = { 2,2,2,3,3,3,4,4,4,5 };
int Wind_Arrow_Damage[10] = { 15,24,32,39,45,50,54,57,59,60 };
int Wind_Arrow_UseMana[10] = { 12,14,16,18,20,23,26,29,32,35 };

//夺命之箭
int Perfect_Aim_Attack_Rate[10] = { 26,27,29,32,36,41,47,54,62,71 };
int Perfect_Aim_Damage[10] = { 4,6,8,10,12,14,16,18,19,20 };
int Perfect_Aim_Damage_LV[10] = { 8,8,8,8,7,7,7,6,6,6 };
int Perfect_Aim_UseMana[10] = { 14,16,18,20,22,25,28,31,35,39 };

//射神之眼
int D_Eye_Attack_Rate[10] = { 10,20,30,40,50,60,70,80,90,100 };

//灵魂之鹰
int Falcon_Damage[10][2] = { {10,36},{12,40},{14,44},{16,48},{18,52},{20,56},{22,60},{24,64},{26,68},{28,72} };
int Falcon_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Falcon_UseMana[10] = { 24,26,28,30,33,36,39,43,47,52 };

//狂暴火箭
int A_Rage_ArrowNum[10] = { 2,3,4,5,6,7,8,9,10,11 };
int A_Rage_Damage[10] = { 5,4,3,2,1,2,3,4,5,6 };
int A_Rage_Area[10] = { 80,80,90,90,100,100,110,120,130,140 };
int A_Rage_UseMana[10] = { 24,26,28,31,34,37,40,44,48,53 };

//雪崩之箭
int Avalanche_Speed[10] = { 1,1,2,2,3,3,4,4,5,6 };
int Avalanche_Damage[10] = { 10,17,24,31,38,45,52,59,66,73 };
int Avalanche_ArrowNum[10] = { 3,3,3,4,4,4,5,5,5,6 };
int Avalanche_UseMana[10] = { 25,28,31,35,39,43,48,53,58,64 };

//元素攻击
int Elemental_Shot_Ice[10][2] = { {10,20},{13,24},{16,28},{19,32},{22,36},{25,40},{28,44},{31,48},{34,52},{37,56} };
int Elemental_Shot_Fire[10][2] = { {12,22},{17,27},{22,32},{27,37},{32,42},{37,47},{42,52},{47,57},{52,62},{57,67} };
int Elemental_Shot_Lightning[10][2] = { {5,17},{9,22},{13,27},{17,32},{21,37},{25,42},{29,47},{33,52},{37,57},{41,62} };
int Elemental_Shot_UseMana[10] = { 27,29,31,33,36,39,42,45,48,51 };

//黄金猎鹰
int Golden_Falcon_Damage[10] = { 20,40,60,80,100,120,140,160,180,200 };
float Golden_Falcon_LifeRegen[10] = { 1.5f,3.0f,4.5f,6.0f,7.5f,9.0f,10.5f,12.0f,13.5f,15.0f };
int Golden_Falcon_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Golden_Falcon_UseMana[10] = { 33,36,39,42,46,50,54,59,64,70 };

//爆裂之箭
int BombShot_Damage[10] = { 10,20,30,40,50,60,70,80,90,100 };
int BombShot_DemonDamage[10] = { 110,120,130,140,150,160,170,180,190,200 };
int BombShot_AddDamage[10][2] = { {25,50},{50,100},{75,150},{100,200},{125,250},{150,300},{175,350},{200,400},{225,450},{250,500} };
int BombShot_Area[10] = { 110,110,120,120,130,130,140,140,150,150 };
int BombShot_UseMana[10] = { 28,31,34,37,40,43,46,49,52,53 };

//惯穿之箭
int Perforation_Attack_Range[10] = { 7,14,21,28,35,42,49,56,63,70 };
int Perforation_Damage[10] = { 17,26,35,44,53,62,71,80,89,98 };
int Perforation_Critical[10] = { 4,8,12,16,20,24,28,32,36,40 };
int Perforation_UseMana[10] = { 28,31,34,37,40,43,46,49,52,53 };

//雪狼
int Recall_Wolverin_Damage[10][2] = { {155,180},{165,190},{175,200},{185,210},{195,220},{205,230},{215,240},{225,250},{235,260},{245,270} };
int Recall_Wolverin_Hit[10] = { 400,800,1200,1600,2000,2800,3200,3600,4000 };
int Recall_Wolverin_Defense[10] = { 500,1000,1500,2000,2500,3000,3500,4000,4500,5000 };
int Recall_Wolverin_Life[10] = { 3000,6000,9000,12000,15000,18000,21000,24000,27000,30000 };
int Recall_Wolverin_UseMana[10] = { 52,56,60,64,68,72,76,80,84,88 };

//躲避大师
int Evasion_Mastery_AddPercent[10] = { 5,7,9,11,13,15,17,19,21,23 };

//绯凰绝炎
int Phoenix_Shot_DamagePercent[10] = { 50,64,78,92,106,120,134,148,162,172 };
int Phoenix_Shot_Time[10] = { 9,18,27,36,45,54,63,72,81,90 };
int Phoenix_Shot_UseMana[10] = { 33,35,37,40,43,46,50,54,58,62 };

//自然之光
int Force_Of_Nature_AddDamage[10] = { 12,24,36,48,60,72,84,96,108,120 };
int Force_Of_Nature_AddHit[10] = { 20,30,40,50,60,70,80,90,100,110 };
int Force_Of_Nature_FalconAddDamage[10] = { 10,14,18,22,26,30,34,38,42,46 };
int Force_Of_Nature_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Force_Of_Nature_UseMana[10] = { 51,54,57,60,63,66,69,72,75,78 };

//回旋之舞
int E_Shot_Damge[10] = { 70,75,80,85,90,95,100,105,110,115 };
int E_Shot_Range[10] = { 140,140,140,140,140,140,140,140,140,140 };
int E_Shot_UseMana[10] = { 40,43,46,49,52,55,58,61,64,67 };
//玄光之箭
int S_Rope_Damge[10] = { 75,80,85,90,95,100,105,110,115,120 };
int S_Rope_AddRange[10] = { 20,25,30,35,40,45,50,55,60,65 };
int S_Rope_UseMana[10] = { 40,43,46,49,52,55,58,61,64,67 };
//飓风之箭
int N_Splash_Damge[10] = { 70,75,80,85,90,95,100,105,110,115 };
int N_Splash_Range[10] = { 95,100,105,110,115,120,125,130,135,140 };
int N_Splash_UseMana[10] = { 45,48,51,54,57,60,63,66,69,72 };
//复仇箭雨
int C_Trap_Dmage[10] = { 80,85,90,95,100,105,110,115,120,125 };
int C_Trap_Area[10] = { 95,100,105,110,115,120,125,130,135,140 };
int C_Trap_UseMana[10] = { 83,85,87,89,91,93,95,97,99,101 };

/////////////// 游侠
//魔神剑
int Sword_Blast_UseMana[10] = { 8,10,12,15,18,21,25,29,33,38 };
int Sword_Blast_Damage[10][2] = { {20,30},{30,40},{40,50},{50,60},{60,70},{70,80},{80,90},{90,100},{100,110},{110,120} };
int Sword_Blast_ShootingRange[10] = { 70,75,80,85,90,95,100,105,110,120 };

//圣光护体
int HolyBody_UseMana[10] = { 18,21,24,27,30,34,38,42,46,50 };
int HolyBody_Absorb[10] = { 8,12,16,19,22,25,27,29,31,33 };
int HolyBody_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };

//超能体训
int P_Traning_Stamina[10] = { 5,8,11,14,17,20,23,26,28,30 };

//双重爆击
int D_Crash_UseMana[10] = { 18,20,22,24,27,30,33,36,39,42 };
int D_Crash_Damage[10] = { 9,18,27,36,45,54,63,72,81,90 };
int D_Crash_Critical[10] = { 2,4,6,8,10,11,12,13,14,15 };

//神力重击
int Holy_Valor_Damage[10] = { 6,10,14,18,22,26,30,34,38,42 };
int Holy_Valor_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Holy_Valor_Mana[10] = { 23,26,29,32,35,38,41,44,47,50 };

//狂躁挥舞
int Brandish_Range[10] = { 93,96,99,102,105,108,111,114,117,120 };
int Brandish_Damage[10] = { 70,75,81,88,96,104,113,122,131,140 };
int Brandish_Mana[10] = { 22,24,26,28,30,33,36,39,42,45 };

//一雾银
int Piercing_Damage[10] = { 85,90,95,100,105,110,120,130,140,150 };
int Piercing_Range[10] = { 180,220,250,280,320,350,410,430,450 };
int Piercing_Mana[10] = { 24,26,28,30,32,34,36,38,40,42 };

//天佑神铠
int Drastic_Spirit_Defense[10] = { 4,6,8,10,12,14,16,18,20,22 };
int Drastic_Spirit_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Drastic_Spirit_Mana[10] = { 25,27,29,32,35,38,41,45,49,54 };

//精剑之术
int Sword_Mastery_DamagePercent[10] = { 8,11,14,17,20,23,26,29,32,35 };

//圣灵之吸
int D_Inhalation_Life[10] = { 9,18,27,36,45,54,63,72,81,90 };
int D_Inhalation_Block[10] = { 1,1,1,2,2,2,3,3,4 };
int D_Inhalation_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int D_Inhalation_UseMana[10] = { 30,33,36,39,43,47,51,55,60,65 };

//圣剡之光
int H_Incantation_Success[10] = { 45,54,62,69,75,80,84,88,92,96 };
int H_Incantation_AddLife[10] = { 100,120,140,160,180,200,220,240,260,280 };
int H_Incantation_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int H_Incantation_UseMana[10] = { 36,39,42,45,48,52,56,60,65,70 };

//圣光十字
int Grand_Cross_Damage[10] = { 35,40,45,50,55,60,65,70,75,80 };
int Grand_Cross_AttackRate[10] = { 35,40,45,50,55,60,65,70,75,80 };
int Grand_Cross_UndeadDamage[10] = { 35,40,45,50,55,60,65,70,75,80 };
int Grand_Cross_UseMana[10] = { 28,31,34,37,40,43,46,49,52,55 };

//真魔神剑
int Sword_Of_Justice_DamagePercent[10] = { 70,80,90,100,110,120,130,140,150,160 };
int Sword_Of_Justice_Area[10] = { 100,110,120,130,140,160,180,200,220,240 };
int Sword_Of_Justice_UseMana[10] = { 50,53,56,59,62,65,68,71,74,77 };

//敬神之盾
int Godly_Shield_AbsorbPercent[10] = { 2,4,6,8,10,12,15,18,21,25 };
int Godly_Shield_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Godly_Shield_UseMana[10] = { 47,50,53,56,59,62,65,68,71,74 };

//上帝祝福
int God_Bless_AddDamage[10] = { 30,40,50,60,70,80,90,100,110,120 };
int God_Bless_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int God_Bless_UseMana[10] = { 57,60,63,66,69,72,75,78,81,84 };

//刹剧荒舞
int Divine_Piercing_DamagePercent[10] = { 32,39,46,53,60,67,74,81,88,95 };
int Divine_Piercing_AddHit[10] = { 20,30,40,50,50,60,70,80,80,90 };
int Divine_Piercing_AttackNum[10] = { 3,3,3,3,5,5,5,5,7,7 };
int Divine_Piercing_UseMana[10] = { 45,47,49,51,53,55,57,59,61,63 };

//神力冲刺
int S_Breaker_Damage[10] = { 40,58,76,94,112,130,148,166,184,202 };
int S_Breaker_AddHit[10] = { 40,45,50,55,60,65,70,75,80,85 };
int S_Breaker_UseMana[10] = { 58,61,64,67,70,73,76,79,72,85 };
//升龙重击
int C_Moon_Damage[10] = { 170,180,190,200,210,220,230,240,250,260 };
int C_Moon_Area[10] = { 70,75,81,88,96,104,113,122,131,140 };
int C_Moon_UseMana[10] = { 63,66,69,72,75,78,81,84,87,90 };
//上帝重击
int S_Blade_Damage[10] = { 50,70,90,110,130,150,170,190,210,230 };
int S_Blade_UndeadDamage[10] = { 5,10,15,20,25,30,35,40,45,50 };
int S_Blade_UseMana[10] = { 58,61,64,67,70,73,76,79,82,85 };
//亡灵之咒
int H_Benedic_Hit[10] = { 5,8,11,14,17,20,23,26,29,32 };
int H_Benedic_Time[10] = { 120,110,100,90,80,70,60,50,40,30 };
int H_Benedic_UseMana[10] = { 86,90,94,98,102,106,110,114,118,122 };

/////////// 魔枪
//美杜莎盾
int S_Strike_UseMana[10] = { 16,18,20,22,24,27,30,33,36,40 };
int S_Strike_Damage[10][2] = { {4,20},{5,25},{6,30},{8,35},{10,40},{12,45},{14,50},{16,55},{18,60},{20,65} };
int S_Strike_Stun[10] = { 6,9,12,15,18,21,24,27,30,34 };

//含沙射影
int Farina_UseMana[10] = { 17,19,21,23,26,29,32,35,38,41 };
int Farina_Speed[10] = { 1,1,1,1,2,2,2,2,2,2 };
int Farina_AttackRate[10] = { 30,40,50,60,70,80,90,100,110,120 };

//魔力神枪
int T_Mastery_Damage[10] = { 9,12,15,18,21,24,27,30,33,36 };

//精神之枪
int V_Spear_UseMana[10] = { 19,21,23,25,28,31,34,37,40,43 };
int V_Spear_Damage[10][2] = { {4,10},{6,15},{8,20},{10,25},{11,30},{12,35},{13,40},{14,45},{15,50},{16,55} };

//追命劲风
int Windy_Attack_Rating[10] = { 20,40,60,80,100,120,140,160,180,200 };
int Windy_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Windy_Mana[10] = { 24,26,28,30,32,34,37,40,44,48 };

//螺旋飞标
int Twist_Javelin_Damage[10] = { 10,20,30,40,50,60,70,80,90,120 };
int Twist_Javelin_Attack_Rating[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Twist_Javelin_Mana[10] = { 20,22,24,27,30,33,36,40,44,48 };

//灵魂吞噬
int Soul_Sucker_Absorb[10] = { 2,4,6,8,10,12,13,14,15,16 };
int Soul_Sucker_Mana[10] = { 25,28,31,34,38,42,46,50,55,60 };

//火焰烈枪
int Fire_Javelin_Damage[10][2] = { {20,30},{25,35},{30,40},{35,45},{40,50},{45,55},{50,60},{55,65},{60,70},{65,75} };
int Fire_Javelin_Mana[10] = { 25,27,29,32,35,38,41,44,47,50 };

//追风之枪
int Split_Javelin_AttackNum[10] = { 3,3,3,3,3,3,3,3,3,3 };
int Split_Javelin_Damage[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Split_Javelin_AttackRate[10] = { 1,2,3,4,5,6,7,8,9,10 };
int Split_Javelin_UseMana[10] = { 30,33,36,39,42,45,48,51,54,57 };

//战栗咆哮
int T_Of_Valhalla_Damage[10] = { 4,8,12,16,20,24,28,32,36,40 };
int T_Of_Valhalla_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int T_Of_Valhalla_UseMana[10] = { 32,34,36,39,42,45,49,54,59,65 };

//光猎之枪
int Lightning_Javelin_Damage[10][2] = { {20,40},{23,46},{26,52},{29,58},{32,64},{35,70},{38,76},{41,82},{44,88},{47,96} };
int Lightning_Javelin_UseMana[10] = { 30,32,34,37,40,43,47,50,53,56 };

//暴风狂标
int Storm_Javelin_Damage[10] = { 10,20,30,40,50,60,70,80,90,100 };
int Storm_Javelin_UseMana[10] = { 34,36,38,41,44,47,50,53,56,59 };

//瓦尔哈拉之光
int Hall_Of_Valhalla_AddEvation[10] = { 5,7,9,11,13,15,17,19,21,23 };
int Hall_Of_Valhalla_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Hall_Of_Valhalla_UseMana[10] = { 36,39,42,45,48,52,56,60,65,70 };

//十字怒击
int X_Rage_DamagePercent[10] = { 50,60,70,80,90,100,110,120,130,140 };
int X_Rage_Area[10] = { 95,100,105,110,115,120,125,130,135,140 };
int X_Rage_UseMana[10] = { 34,36,38,41,44,47,50,54,58,62 };

//霜冻标枪
int Frost_Javelin_IceAddDamage[10][2] = { {12,22},{14,24},{16,26},{18,28},{20,30},{22,32},{24,34},{26,34},{28,38},{30,40} };
int Frost_Javelin_SpeedSubPercent[10] = { 4,5,6,7,8,9,10,11,12,13 };
int Frost_Javelin_IceTime[10] = { 3,3,3,4,4,4,5,5,5,6 };
int Frost_Javelin_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Frost_Javelin_UseMana[10] = { 33,36,39,42,44,48,52,56,60,65 };

//狂风爆裂
int Vengeance_DamagePercent[10] = { 8,16,24,32,40,48,56,64,72,80 };
int Vengeance_Range[10] = { 5,10,15,20,25,30,35,40,45,50 };
int Vengeance_UseMana[10] = { 36,39,42,45,49,53,57,62,67,72 };
int Vengeance_AddCritical[10] = { 2,4,6,8,10,13,16,19,22,25 };

// 轻舞飞扬
int Talaria_MoveSpeed[10] = { 1,1,1,2,2,2,3,3,3,4 };
int Talaria_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Talaria_UseMana[10] = { 55,57,59,62,65,68,72,76,80,84 };
// 星雨标枪
int G_Coup_Damage[10] = { 20,30,40,50,60,70,80,90,100,110 };
int G_Coup_Hit[10] = { 2,2,4,4,6,6,8,8,10,10 };
int G_Coup_UseMana[10] = { 40,43,46,49,52,55,58,61,64,67 };
// 笨笨熊
int S_Arcuda_Damage[10][2] = { {180,205},{190,215},{200,225},{210,235},{220,245},{230,255},{240,265},{250,275},{260,285},{270,295} };
int S_Arcuda_AtkRating[10] = { 200,400,600,800,1000,1200,1400,1600,1800,2000 };
int S_Arcuda_PetHp[10] = { 3000,6000,9000,12000,15000,18000,21000,24000,27000,30000 };
int S_Arcuda_Defanse[10] = { 500,1000,1500,2000,2500,3000,3500,4000,4500,5000 };
int S_Arcuda_UseMana[10] = { 73,75,77,80,83,86,90,94,98,102 };
// 烈焰突袭
int S_Fear_Damage[10] = { 30,40,50,60,70,80,90,100,110,120 };
int S_Fear_AddCritical[10] = { 6,8,10,12,14,16,18,20,22,24 };
int S_Fear_UseMana[10] = { 45,48,51,54,57,60,63,66,69 };


////////////祭司
//治愈之术
int Healing_UseMana[10] = { 11,14,17,20,24,28,32,37,42,47 };
int Healing_Heal[10][2] = { {30,40},{60,70},{90,100},{120,130},{150,160},{180,190},{210,220},{240,250},{270,280},{300,310} };

//圣光电球
int HolyBolt_UseMana[10] = { 14,17,20,23,27,31,35,40,45,50 };
int HolyBolt_Damage[10][2] = { {10,22},{13,25},{16,28},{19,31},{22,34},{25,37},{28,41},{31,45},{34,49},{37,53} };

//光芒四射
int M_Spark_UseMana[10] = { 16,19,22,25,29,33,37,42,47,52 };
int M_Spark_Damage[10][2] = { {5,10},{6,12},{7,14},{8,16},{9,18},{10,20},{11,21},{12,22},{13,23},{14,34} };
int M_Spark_Num[10] = { 4,4,4,5,5,5,6,6,7,7 };

//意念之术
int HolyMind_UseMana[10] = { 22,25,28,32,36,40,45,50,55,60 };
int HolyMind_DecDamage[10] = { 23,26,29,32,35,38,41,44,47,50 };
int HolyMind_Time[10] = { 25,25,25,25,25,25,25,25,25,25 };

//曙光耀灵
float Meditation_Regen[10] = { 1.0f,2.0f,3.0f,4.0f,5.0f,8.0f,11.0f,15.0f,20.0f,25.0f };

//神之雷电
int Divine_Lightning_Damage[10][2] = { {20,40},{23,44},{26,48},{29,52},{32,56},{35,60},{38,64},{41,68},{44,72},{47,76} };
int Divine_Lightning_Num[10] = { 3,3,3,4,4,4,5,5,5,6 };
int Divine_Lightning_Mana[10] = { 24,26,28,31,34,37,40,44,48,53 };

//神圣反射
int Holy_Reflection_Return_Damage[10] = { 15,30,45,60,75,90,105,120,135,150 };
int Holy_Reflection_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Holy_Reflection_Mana[10] = { 24,27,30,33,36,40,44,48,52,57 };

//圣洁之光
int Grand_Healing[10][2] = { {20,30},{30,40},{40,50},{50,60},{60,70},{70,80},{80,90},{90,100},{100,110},{110,120} };
int Grand_Healing_Range[10] = { 300,310,320,330,340,350,360,370,380,390 };
int Grand_Healing_Mana[10] = { 24,26,29,32,36,40,44,49,54,59 };

//火影双重
int Vigor_Ball_Damage[10][2] = { {50,70},{70,90},{90,110},{110,130},{130,150},{150,170},{170,190},{190,210},{210,230},{230,250} };
int Vigor_Ball_UseMana[10] = { 26,28,30,33,36,39,42,45,48,51 };

//回生之术
int Resurrection_Percent[10] = { 40,47,54,61,67,73,79,84,89,94 };
int Resurrection_Exp[10] = { 100,150,200,250,300,350,400,450,500,550 };
int Resurrection_UseMana[10] = { 70,66,62,58,54,50,46,42,38,34 };

//圣光之咒
int Extinction_Percent[10] = { 60,64,68,72,76,80,84,88,92,96 };
int Extinction_Amount[10] = { 26,28,30,32,34,36,38,40,42,44 };
int Extinction_UseMana[10] = { 30,32,34,37,40,43,47,51,55,60 };

//神圣之光
int Virtual_Life_Percent[10] = { 3,6,9,12,15,18,21,24,27,30 };
int Virtual_Life_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Virtual_Life_UseMana[10] = { 60,63,66,69,73,77,81,86,91,97 };

//冰霜噬月
int Glacial_Spike_Damage[10][2] = { {80,100},{90,110},{100,120},{110,130},{120,140},{130,150},{140,160},{150,170},{160,180},{170,190} };
int Glacial_Spike_Area[10] = { 150,155,160,165,170,175,180,185,190,195 };
int Glacial_Spike_UseMana[10] = { 65,68,71,74,77,80,83,86,89,92 };

//再生领域
float Regeneration_Field_LifeRegen[10] = { 20.0f,25.0f,30.0f,35.0f,40.0f,45.0f,50.0f,55.0f,60.0f,65.0f };
float Regeneration_Field_ManaRegen[10] = { 30.0f,35.0f,40.0f,45.0f,50.0f,55.0f,60.0f,65.0f,70.0f,75.0f };
int   Regeneration_Field_Time[10] = { 10,20,30,40,50,60,70,80,90,100 };
int   Regeneration_Field_Area[10] = { 250,260,270,280,290,300,310,320,330,340 };
int   Regeneration_Field_UseMana[10] = { 100,104,108,112,116,120,124,128,132,136 };

//天雷之怒
int Chain_Lightning_Damage[10][2] = { {50,70},{70,90},{90,110},{110,130},{130,150},{150,170},{170,190},{190,210},{210,230},{230,250} };
int Chain_Lightning_Num[10] = { 3,4,5,6,7,8,9,10,11,12 };
int Chain_Lightning_Range[10] = { 110,120,130,140,150,160,170,180,190,200 };
int Chain_Lightning_UseMana[10] = { 76,79,82,85,88,91,94,97,100,103 };

//神圣天使
int Summon_Muspell_Damage[10][2] = { {35,60},{45,70},{55,80},{65,90},{75,100},{85,110},{95,120},{105,130},{115,140},{125,150} };
int Summon_Muspell_Attack_Delay[10] = { 4,4,4,3,3,3,2,2,2,1 };
int Summon_Muspell_UndeadAbsorbPercent[10] = { 5,10,15,20,25,30,35,40,45,50 };
int Summon_Muspell_BlockPercent[10] = { 6,7,8,9,10,11,12,13,14,15 };
int Summon_Muspell_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Summon_Muspell_UseMana[10] = { 110,114,118,122,126,130,134,138,140,146 };

// 神圣电波
int S_Impact_Damage[10][2] = { {50,70},{70,90},{90,110},{110,130},{130,150},{150,170},{170,190},{190,210},{210,230},{230,250} };
int S_Impact_Range[10] = { 170,175,180,185,190,195,200,205,210,215 };
int S_Impact_UseMana[10] = { 100,104,108,112,116,120,124,128,132,136 };
// 神之冰刃
int P_Ice_Damge[10][2] = { {50,70},{70,90},{90,110},{110,130},{130,150},{150,170},{170,190},{190,210},{210,230},{230,250} };
int P_Ice_Frozen[10] = { 6,7,8,9,10,11,12,13,14,15 };
int P_Ice_UseMana[10] = { 102,106,110,114,118,122,126,130,134,138 };
// 暴风雪
int S_Ramiel_Damage[10][2] = { {25,50},{50,75},{75,100},{100,125},{125,150},{150,175},{175,200},{200,225},{225,250},{250,275} };
int S_Ramiel_Area[10] = { 60,70,80,100,120,140,160,180,200,220 };
int S_Ramiel_Num[10] = { 1,1,1,2,3,4,5,6,7,8 };
int S_Ramiel_UseMana[10] = { 104,108,112,116,120,124,128,132,136,140 };
// 天女散花
int B_Krishna_Evasion[10] = { 10,15,20,25,30,35,40,45,50,55 };
int B_Krishna_Abs[10] = { 2,2,2,5,5,5,8,8,8,10 };
int B_Krishna_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int B_Krishna_UseMana[10] = { 110,114,118,122,126,130,134,138,140,146 };



/////////////法师
//魔力转化
int Agony_UseMana[10] = { 5,6,7,8,9,10,11,12,13,14 };
int Agony_ConvLife[10] = { 4,8,12,16,20,24,28,32,36,40 };

//火箭之术
int FireBolt_UseMana[10] = { 16,18,20,22,25,28,31,34,38,42 };
int FireBolt_Damage[10][2] = { {10,20},{13,24},{16,28},{19,32},{21,36},{24,40},{27,44},{30,48},{33,52},{36,56} };

//集合之术
int Zenith_UseMana[10] = { 18,20,22,25,28,31,35,39,43,48 };
int Zenith_Element[10] = { 5,10,15,20,25,30,35,40,45,50 };
int Zenith_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };

//火球之术
int FireBall_UseMana[10] = { 22,24,26,28,31,34,38,42,46,50 };
int FireBall_Damage[10][2] = { {16,40},{20,47},{24,54},{28,61},{32,68},{36,75},{40,82},{44,89},{48,96},{52,103} };
int FireBall_Area[10] = { 70,72,74,76,78,80,82,84,86,88 };
int FireBall_Range[10] = { 163,166,169,172,175,178,181,184,187,190 };

//控制意念
int Mental_Mastery_Mana[10] = { 4,8,12,16,20,24,28,32,36,40 };

//龙卷海风
int Watornado_Damage[10][2] = { {30,56},{34,63},{38,70},{42,77},{46,84},{50,91},{54,98},{58,105},{62,112},{66,119} };
int Watornado_Area[10] = { 70,72,74,76,78,80,82,84,86,88 };
int Watornado_Range[10] = { 170,174,178,182,186,190,194,198,202,206 };
int Watornado_Mana[10] = { 25,27,29,32,35,38,42,46,50,55 };

//元素之术
int Enchant_Weapon_Damage_Ice[10][2] = { {2,3},{4,6},{6,8},{8,12},{10,15},{12,18},{14,21},{16,24},{18,27},{20,30} };
int Enchant_Weapon_Damage_Fire[10][2] = { {3,5},{6,10},{9,15},{12,20},{15,25},{18,30},{21,35},{24,40},{27,45},{30,50} };
int Enchant_Weapon_Damage_Lightning[10][2] = { {2,6},{4,12},{6,18},{8,24},{10,30},{12,36},{14,42},{16,48},{18,54},{20,60} };
int Enchant_Weapon_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Enchant_Weapon_Mana[10] = { 30,32,34,37,40,44,48,53,58,64 };

//冥亡之光
int Dead_Ray_Damage[10][2] = { {45,65},{50,71},{55,77},{60,83},{65,89},{70,95},{75,101},{80,107},{85,113},{90,119} };
int Dead_Ray_Range[10] = { 185,190,195,200,205,210,215,220,225,230 };
int Dead_Ray_Mana[10] = { 26,29,32,35,39,43,47,51,55,59 };

//魔法守护
int Energy_Shield_DecDamage[10] = { 3,6,9,12,15,18,21,24,27,30 };
int Energy_Shield_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Energy_Shield_UseMana[10] = { 34,37,40,43,47,51,55,60,66,72 };

//地裂冲击
int Diastrophism_Damage[10][2] = { {20,56},{27,64},{34,72},{41,80},{48,88},{55,96},{62,104},{69,112},{76,120},{83,128} };
int Diastrophism_Area[10] = { 100,105,110,115,120,125,130,135,140,145 };
int Diastrophism_UseMana[10] = { 30,33,36,39,43,47,51,56,61,67 };

//灵魂召唤
float Spirit_Elemental_RegenMana[10] = { 0.2f,0.4f,0.6f,0.8f,1.0f,1.2f,1.4f,1.6f,1.8f,2.0f };
int Spirit_Elemental_Damage[10] = { 8,11,14,17,20,23,26,29,32,35 };
int Spirit_Elemental_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Spirit_Elemental_UseMana[10] = { 36,39,42,45,48,51,54,57,60,63 };

//元素之剑
int Dancing_Sword_IceDamage[10][2] = { {20,26},{22,29},{24,32},{26,35},{28,38},{30,41},{32,44},{34,47},{36,50},{38,53} };
int Dancing_Sword_FireDamage[10][2] = { {20,26},{23,30},{26,34},{29,38},{32,42},{35,46},{38,50},{41,54},{44,58},{47,62} };
int Dancing_Sword_AttackDelay[10] = { 4,4,4,3,3,3,2,2,2,1 };
int Dancing_Sword_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Dancing_Sword_UseMana[10] = { 35,37,39,42,45,48,52,56,61,66 };

//伊夫列特
int Fire_Elemental_Damage[10][2] = { {180,205},{190,215},{200,225},{210,235},{220,245},{230,255},{240,265},{250,275},{260,285},{270,295} };
int Fire_Elemental_Hit[10] = { 200,400,600,800,1000,1200,1400,1600,1800,2000 };
int Fire_Elemental_Life[10] = { 3000,6000,9000,12000,15000,18000,21000,24000,27000,30000 };
int Fire_Elemental_UseMana[10] = { 52,56,60,64,68,72,76,80,84,88 };

//火焰波动
int Flame_Wave_FireDamage[10][2] = { {80,90},{90,102},{100,114},{110,126},{120,138},{130,150},{140,162},{150,174},{160,186},{170,198} };
int Flame_Wave_Area[10] = { 110,120,130,140,150,160,170,180,190,200 };
int Flame_Wave_UseMana[10] = { 75,79,83,87,91,95,99,103,107,111 };

//空间扭曲
int Distortion_SpeedSubPercent[10] = { 4,6,8,10,12,14,16,18,20,22 };
int Distortion_DamageSubPercent[10] = { 5,6,7,8,9,10,11,12,13,14 };
int Distortion_Area[10] = { 120,125,130,135,140,145,150,155,160,165 };
int Distortion_Time[10] = { 2,2,4,4,6,6,8,8,10,10 };
int Distortion_UseMana[10] = { 105,110,115,120,125,130,135,140,145,150 };

//招呼陨石
int Meteo_Damage[10][2] = { {80,110},{92,122},{104,134},{116,146},{128,158},{140,170},{152,182},{164,194},{179,206},{188,218} };
int Meteo_Area[10] = { 100,105,110,115,120,125,130,135,140,145 };
int Meteo_UseMana[10] = { 100,104,108,112,116,120,124,128,132,136 };

// 流星火雨
int Silraphim_Damage[10][2] = { {90,120},{100,130},{110,140},{120,150},{130,160},{140,170},{150,180},{160,190},{170,200},{170,210} };
int Silraphim_Range[10] = { 110,120,130,140,150,160,170,180,190,200 };
int Silraphim_UseMana[10] = { 120,125,130,135,140,145,150,155,160,165 };
//缩小之术
int V_Tenus_SubSpeed[10] = { 10,12,14,18,20,22,24,26,28,30 };
int V_Tenus_Time[10] = { 10,12,14,18,20,22,24,26,28,30 };
int V_Tenus_Range[10] = { 110,120,130,140,150,160,170,180,190,200 };
int V_Tenus_UseMana[10] = { 135,139,143,147,151,155,159,163,167,171 };
// 神圣洗礼
int P_Ignis_Dmage[10][2] = { {120,150},{130,160},{140,170},{150,180},{160,190},{170,190},{180,200},{190,210},{200,220},{210,230} };
int P_Ignis_Area[10] = { 120,125,130,135,140,145,150,155,160,165 };
int P_Ignis_Hit[10] = { 3,3,3,4,5,6,7,8,9,10 };
int P_Ignis_UseMana[10] = { 152,156,160,164,168,172,176,180,184,188 };
//神圣法阵
int T_Anima_Dmage[10] = { 20,30,40,50,60,70,80,90,100,110 };
int T_Anima_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int T_Anima_UseMana[10] = { 166,170,174,178,182,186,190,194,198,202 };

// 刺客

//刺击
int Stinger_Damage[10] = { 33,36,39,42,45,48,51,54,57,60 };
int Stinger_UseMana[10] = { 8,10,12,15,18,21,25,29,33,37 };

//闪击
int Running_Hit_Damage[10] = { 52,55,58,61,64,67,70,73,76,79 };
int Running_Hit_UseMana[10] = { 14,16,18,20,22,24,26,29,31,34 };

//强化攻击
int Sword_Mastery_Damage[10] = { 5,7,9,11,14,17,20,23,27,31 };

//弱点攻击
int Wisp_Damage[10] = { 6,8,10,12,14,16,18,20,22,24 };
int Wisp_Range[10] = { 100,100,100,100,100,100,100,100,100,100 };
int Wisp_Time[10] = { 10,10,10,12,12,12,14,14,14,16 };
int Wisp_UseMana[10] = { 16,18,20,23,26,29,32,35,39,43 };

//毒牙连击
int Venom_Thorn_Damage[10] = { 50,54,58,62,66,70,74,78,82,86 };
int Venom_Thorn_Ratio[10] = { 40,45,50,55,60,65,70,75,80,85 };
int Verom_Thorn_Time[10] = { 6,6,7,7,8,8,9,10,11,12 };
int Verom_Thorn_UseMana[10] = { 18,20,22,24,27,30,33,37,41,46 };

//敏捷之力
int Alas_Eavsion[10] = { 2,3,4,5,6,7,8,9,10,12 };
int Alas_Area[10] = { 200,220,240,260,280,300,320,340,360,380 };
int Alas_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Ales_UseMana[10] = { 23,25,27,29,32,35,38,42,46,51 };

//灵魂震撼
int Soul_Shock_Area[10] = { 70,75,80,85,90,100,105,110,115 };
int Soul_Shock_Time[10] = { 2,3,4,5,6,7,8,9,10,12 };
int Soul_Shock_UseMana[10] = { 39,41,43,45,47,49,51,53,55,57 };

//攻击大师
int Blade_Mastery_Attack[10] = { 8,14,20,26,32,38,44,50,56,62 };
int Blade_Mastery_Evasion[10] = { 2,3,4,5,6,8,10,12,14,16 };

//飞剑之舞
int Finishing_Blow_Damage[10] = { 84,88,92,96,100,104,108,112,116,120 };
int Finishing_Blow_UseMana[10] = { 30,33,36,39,42,45,48,51,54,57 };

//跳斩
int Gust_Slash_Damage[10] = { 55,60,65,70,75,80,85,90,95,100 };
int Gust_Slash_Area[10] = { 80,80,80,80,80,80,80,80,80,80 };
int Gust_Shash_UseMana[10] = { 40,43,46,49,52,55,58,62,66,71 };

//敏捷大师
int Inpes_Atk_Speed[10] = { 2,4,6,8,10,11,12,13,14,15 };
int Inpes_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Inpes_UseMana[10] = { 32,35,38,41,44,48,52,56,60,64 };

//致盲
int Deception_Damage[10] = { 10,15,20,25,30,35,40,45,50,55 };
int Deception_Visibility[10] = { -25,-30,-35,-40,-45,-50,-55,-60,-65,-70 };
int Deception_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Deception_UseMana[10] = { 40,43,49,52,55,58,61,64,67,70 };

//冰冻之刃
int Frost_Wind_Damage[10] = { 49,53,57,61,65,69,73,77,81,85 };
int Frost_Wind_UseMana[10] = { 47,49,51,53,55,57,59,61,63,65 };

//致命艺术
int Fatal_Mastery_Critical[10] = { 3,4,5,6,7,8,9,10,11,12 };

//瘟疫之刃
int Pollute_Damage[10] = { 30,36,42,48,54,60,66,72,78,84 };
int Pollute_Area[10] = { 90,94,98,102,106,110,114,118,122,126 };
int Pollute_Ratio[10] = { 15,17,19,21,23,25,27,29,31,33 };
int Pollute_Time[10] = { 5,6,6,7,7,8,8,9,9,10 };
int Pollute_UseMana[10] = { 55,57,59,61,63,65,67,69,71,73 };

//影子闪击
int Shadow_Damage[10] = { 47,52,57,62,67,72,77,82,87,92 };
int Shadow_UseMana[10] = { 52,55,58,61,64,67,70,73,76,79 };

//影子火焰
int Shadow_Bomb_Damage[10] = { 47,52,57,62,67,72,77,82,87,92 };
int Shadow_Bomb_Area[10] = { 70,75,80,85,90,95,100,105,110,115 };
int Shadow_Bomb_Ratio[10] = { 15,17,19,21,23,25,27,29,31,33 };
int Shadow_Bomb_Time[10] = { 2,2,2,3,3,3,4,4,4,5 };
int Shadow_Bomb_UseMana[10] = { 55,58,62,64,67,70,73,76,79,81 };

//地裂斩
int Rising_Slash_Damage[10] = { 60,65,70,75,80,85,90,95,100,105 };
int Rising_Shash_UseMana[10] = { 66,68,70,72,74,76,78,80,82,84 };

//猛龙摆尾
int Violent_Stub_Damage[10] = { 67,72,77,82,97,92,97,102,107,112 };
int Violent_Stub_UseMana[10] = { 75,78,81,84,87,90,93,96,99,101 };

//风暴之刃
int Shadow_Storm_Damage[10] = { 60,64,68,72,76,80,84,88,92,96 };
int Shadow_Storm_Area[10] = { 86,90,94,98,102,106,110,114,118,122 };
int Shadow_Storm_Range[10] = { 53,56,59,62,65,68,71,74,77,80 };
int Shadow_Storm_PushRange[10] = { 85,90,95,100,105,110,115,120,125,130 };
int Shadow_Storm_UseMana[10] = { 120,126,129,124,128,132,136,140,146,152 };

//萨满

//暗黑闪电
int Dark_Bolt_Damage[10] = { 43,46,49,52,55,58,61,64,67,70 };
int Dark_Bolt_UseMana[10] = { 14,16,18,20,22,24,26,28,30,32 };

//暗黑波浪
int Dark_Wave_Damage[10] = { 59,63,67,71,75,79,83,87,91,95 };
int Dark_Wave_UseMana[10] = { 22,24,26,28,30,32,34,36,38,40 };

//诅咒雷击
int Inertia_Speed[10] = { -16,-18,-20,-22,-24,-26,-28,-30,-32,-34 };
int Inertia_Atk[10] = { -11,-12,-13,-14,-15,-16,-17,-18,-19,-11 };
int Inertia_Area[10] = { 80,85,90,95,100,105,110,115,120,125 };
int Inertia_Time[10] = { 3,4,5,6,7,8,9,10,11,12 };
int Inertia_UseMana[10] = { 25,28,31,34,37,40,43,46,49,52 };

//内心平和
int Inner_Peace_AddMana[10] = { 4,7,10,13,16,19,22,25,28,31 };

//精神咒术
int Spiritual_Flare_Damage[10] = { 75,80,85,90,95,100,105,110,115,120 };
int Spiritual_Flare_Rnage[10] = { 175,180,185,190,195,200,205,210,215,220 };
int Spiritual_Flare_Area[10] = { 65,67,69,71,73,75,77,79,81,83 };
int Spiritual_Flare_UseMana[10] = { 25,27,29,31,33,35,37,39,41,43 };

//灵魂枷锁
int Spiritual_Manacle_Ratio[10] = { 45,50,55,60,65,70,75,80,85,90 };
int Spiritual_Manacle_Time[10] = { 3,4,5,5,6,6,7,8,9,10 };
int Spiritual_Manacle_UseMana[10] = { 25,27,29,32,35,38,42,46,50,55 };

//猎取
int Chasing_Hunt_Sight[10] = { 400,420,440,460,480,500,520,540,560,580 };
int Chasing_Hunt_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Chasing_Hunt_UseMana[10] = { 24,26,28,30,32,34,36,38,40,42 };

//迈克尔
int Advent_Migal_Atk[10] = { 30,33,36,39,42,45,48,51,54,57 };
int Advent_Migal_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Advent_Migal_UseMana[10] = { 30,32,34,36,38,40,42,44,46,48 };

//祈雨师
int Rainmaker_Abs[10] = { 4,6,8,10,12,14,16,18,20,22 };
int Rainmaker_AtkRating[10] = { 2,4,6,8,10,12,14,16,18,20 };
int Rainmaker_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Rainmaker_UseMana[10] = { 60,63,66,69,72,75,78,81,84,87 };

//陆地灵魂
int Phantom_Call_Damage[10] = { 65,75,85,95,105,115,125,135,145,155 };
int Phantom_Call_Area[10] = { 100,105,110,115,120,125,130,135,140,145 };
int Phantom_Call_UseMana[10] = { 30,33,36,39,42,45,48,51,54,57 };

//鬼魂重回
int Haunt_Damage[10] = { 130,135,140,145,150,155,160,165,170,175 };
int Haunt_Abs[10] = { 10,13,16,19,22,25,28,31,34,37 };
int Haunt_UseMana[10] = { 65,68,71,74,77,80,83,86,89,92 };

//抓破
int Scratch_Damage[10] = { 150,160,170,180,190,200,210,220,230,240 };
int Scratch_UseMana[10] = { 75,79,82,85,88,91,94,97,100,103 };

//嗜血之夜
int Crimson_Knight_Atk[10][2] = { {180,205},{190,215},{200,225},{210,235},{220,245},{230,255},{240,265},{250,275},{260,285},{270,295} };
int Crimson_Knight_AtkRating[10] = { 200,400,600,800,1000,1200,1400,1600,1800,2000 };
int Crimson_Knight_PetHp[10] = { 2000,4000,6000,8000,10000,12000,14000,16000,18000,20000 };
int Crimson_Knight_Defanse[10] = { 1000,2000,3000,4000,5000,6000,7000,8000,9000,10000 };
int Crimson_Knight_UseMana[10] = { 76,79,82,85,88,91,94,97,100,103 };

//审判
int Judgement_Damage[10] = { 230,240,260,270,280,290,300,310,320 };
int Judgement_UseMana[10] = { 100,104,108,112,116,120,124,128,132,136 };

//米德兰达
int Advent_Midranda_Speed[10] = { 2,4,6,8,10,11,12,13,14,15 };
int Advent_Midranda_Area[10] = { 220,220,220,220,220,220,220,220,220,220 };
int Advent_Midranda_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Advent_Midranda_UseMana[10] = { 100,104,108,112,116,120,124,128,132,136 };

//旭日东升
int Mourning_Pray_Damage[10] = { 130,140,150,160,170,180,190,200,210,220 };
int Mourning_Pray_Area[10] = { 110,115,120,125,130,135,140,145,150,155 };
int Mourning_Pray_UseMana[10] = { 110,114,118,122,126,130,134,138,142,146 };

//咒术信仰
int Creed_AddMP[10] = { 22,24,26,28,30,32,34,36,38,40 };
int Creed_AddSP[10] = { 12,14,16,18,20,22,24,26,28,30 };
int Creed_Time[10] = { 300,300,300,300,300,300,300,300,300,300 };
int Creed_UseMana[10] = { 105,110,115,120,125,130,135,140,145,150 };

//诅咒之力
int Press_Deity_Damage[10] = { 180,190,200,210,220,230,240,250,260,270 };
int Press_Deity_Area[10] = { 130,135,140,145,150,155,160,165,170,175 };
int Press_UseMana[10] = { 110,114,118,122,126,130,134,138,142,146 };

//死亡之爪
int Phantom_Nail_Damage[10] = { 100,110,120,130,140,150,160,170,180,190 };
int Phantom_Nail_Area[10] = { 100,105,110,115,120,125,130,135,140,145 };
int Phantom_Nail_UseMana[10] = { 152,156,160,164,168,172,176,180,184,188 };

//高级再升
int Occult_Lift_HP[10] = { 3,6,9,12,15,18,21,24,27,30 };

//傍己傈 努罚胶懦
int C_Skill_HpPoint[10] = { 100,110,120,130,140,150,160,170,180,190 };//hp惑铰
int C_Skill_AttPercent[10] = { 10,11,12,13,14,15,16,17,18,19 };          //傍拜仿 惑铰
int C_Skill_EvaPercent[10] = { 10,11,12,13,14,15,16,17,18,19 };       //雀乔啦 惑铰
